//src/lib/constants.ts

export const GRADES = [
  "ቅድመ መደበኛ", "አንደኛ ክፍል", "ሁለተኛ ክፍል", "ሦስተኛ ክፍል", "አራተኛ ክፍል", "አምስተኛ ክፍል", "ስድስተኛ ክፍል",
  "ሰባተኛ ክፍል ጥዋት", "ሰባተኛ ክፍል ከሰዓት", "ስምንተኛ ክፍል", "ዘጠኝ ክፍል","አስረኛ ክፍል",
  "አስራኛ ክፍል", "አስራ አንደኛ ክፍል", "አስራ ሁለተኛ ክፍል",
];

export const ROLE_VALUES = [
  { value: "Attendance Facilitator", label: "Attendance Facilitator" },
  { value: "Education Facilitator", label: "Education Facilitator" },
];

export const schools = [
  "ሀና", "ሀፒ ቪሌጄ", "ሂልሳይድ", "ህዳሴ", "ሆም ላንድ", "ሊዜም", "መሪ", "ሚሽን", "ማርቭል", "ሜሪኦን",
  "ምስራቅ", "ሰላም", "ሳንፎርድ", "ሳፋሪ", "ስኩል ኦፍ ቱምሮ", "ሮፋም", "ሽቡአጆርሳ", "ቅኔ", "ቅዱስ ሚካኤል",
  "ቅድስት ሬዛ", "በሻሌ", "ቤስት", "ቦሌ አዲስ", "ነዋይ", "ኒሺኒ ሆፕ", "ኒው ሰንላይት", "ናዝሬት",
  "አቡነ ጎርጎርዮስ", "አንድነት", "ኢትዮ ፓረንት", "እርግብ", "ኦዞን", "ኪዳነ ምሕረት", "ኪፓስ", "ካራሎ",
  "ወንድይራድ", "ውለታ", "የኒፎርም", "ያንግሩት", "ዳይመንድ", "ዴሊቨራንስ", "ጂባ", "ጊብሰን", "ግሎሪ",
  "ጽዮን ማርያም", "ፋውንቴን", "ፌርዌይ", "ፓንቶ ኮርቶር", "ፓንቶክራቶን", "ቪዥን", "ኤልቤተል", "ስላሴ ካቴድራል",
  "ሚሸን", "72", "ራዕይ", "ቤዛ", "ቡርቃ ቦሬ", "ሚካኤል", "ኤደን", "ፊውቸር የዝ", "Other"
].map(school => ({ value: school, label: school }));

export const addresses = [
  "ጥቁር አባይ/ሚካኤል ጀርባ አካባቢ", "ሲቪል ሰርቪስ አካባቢ", "ወንድይራድ ት/ቤት አካባቢ",
  "ታቦት ማደሪያ/ኮተቤ ኮሌጅ አካባቢ", "ወሰን/አቅም ግንባታ አካባቢ", "አልታድ (ፊጋ) አካባቢ",
  "ሴፍ የመኖሪያ ቤቶች አካባቢ", "የተባበሩት አካባቢ", "ሰሚት አካባቢ", "ሲኤምሲ", "መሪ", "ላምበረት",
  "02", "ሰባ ሁለት", "ኢትዮ ዋልስ", "ሎቄ", "ኢትዮ ዊልስ", "አቤም", "ጣፎ", "ሰአሊተ ምሕረት", "አያት",
  "ካራ", "አባዶ", "Other"
].map(address => ({ value: address, label: address }));